In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
pd.Series([1,3,5,6,8])

0    1
1    3
2    5
3    6
4    8
dtype: int64

In [4]:
df=pd.DataFrame(data=np.arange(1,49).reshape(12,4), columns=['X1','X2','X3','X4'])
df

    X1  X2  X3  X4
0    1   2   3   4
1    5   6   7   8
2    9  10  11  12
3   13  14  15  16
4   17  18  19  20
5   21  22  23  24
6   25  26  27  28
7   29  30  31  32
8   33  34  35  36
9   37  38  39  40
10  41  42  43  44
11  45  46  47  48

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   X1      12 non-null     int32
 1   X2      12 non-null     int32
 2   X3      12 non-null     int32
 3   X4      12 non-null     int32
dtypes: int32(4)
memory usage: 320.0 bytes

In [6]:
df.describe()

              X1         X2         X3         X4
count  12.000000  12.000000  12.000000  12.000000
mean   23.000000  24.000000  25.000000  26.000000
std    14.422205  14.422205  14.422205  14.422205
min     1.000000   2.000000   3.000000   4.000000
25%    12.000000  13.000000  14.000000  15.000000
50%    23.000000  24.000000  25.000000  26.000000
75%    34.000000  35.000000  36.000000  37.000000
max    45.000000  46.000000  47.000000  48.000000

In [8]:
df.sort_values(by="X2", ascending=False)

    X1  X2  X3  X4
11  45  46  47  48
10  41  42  43  44
9   37  38  39  40
8   33  34  35  36
7   29  30  31  32
6   25  26  27  28
5   21  22  23  24
4   17  18  19  20
3   13  14  15  16
2    9  10  11  12
1    5   6   7   8
0    1   2   3   4

### 판다스로 데이터가지고 놀기

In [9]:
df["X1"]

0      1
1      5
2      9
3     13
4     17
5     21
6     25
7     29
8     33
9     37
10    41
11    45
Name: X1, dtype: int32

In [10]:
df.loc[0]

X1    1
X2    2
X3    3
X4    4
Name: 0, dtype: int32

In [11]:
df.loc[0][2]

3

In [12]:
df.loc[0]["X3"]

3

In [16]:
# df.loc에 2차원 indexing도 가능하다.
# df.loc["row에 대한 조건", "col에 대한 조건"]

df.loc[4,"X2"]
df.loc[[0,3],["X1","X3"]]
df.loc[0:4, "X1":"X3"]

   X1  X2  X3
0   1   2   3
1   5   6   7
2   9  10  11
3  13  14  15
4  17  18  19

In [21]:
mask = df["X1"] > 10  # row에 대한 조건
df.loc[mask]

df.loc[df["X2"] >= 20]

df.loc[df["X2"] >= 20, "X4"]

5     24
6     28
7     32
8     36
9     40
10    44
11    48
Name: X4, dtype: int32

In [25]:
df.loc[(df["X3"] >= 10) & (df["X3"] <= 30)]

   X1  X2  X3  X4
2   9  10  11  12
3  13  14  15  16
4  17  18  19  20
5  21  22  23  24
6  25  26  27  28

In [26]:
df.loc[(30 < df["X2"]) | (10 > df["X2"])]

    X1  X2  X3  X4
0    1   2   3   4
1    5   6   7   8
8   33  34  35  36
9   37  38  39  40
10  41  42  43  44
11  45  46  47  48

In [29]:
# row 8버
df.iloc[3:8, 0:2]

   X1  X2
3  13  14
4  17  18
5  21  22
6  25  26
7  29  30